In [1]:
import numpy as np
import pandas as pd

data = [15, 16, 18, 19, 22, 24, 29, 30, 34]

print("mean:", np.mean(data))
print("median:", np.median(data))
print("50th percentile (median):", np.percentile(data, 50))
print("25th percentile:", np.percentile(data, 25))
print("75th percentile:", np.percentile(data, 75))
print("standard deviation:", np.std(data))
print("variance:", np.var(data))

mean: 23.0
median: 22.0
50th percentile (median): 22.0
25th percentile: 18.0
75th percentile: 29.0
standard deviation: 6.342099196813483
variance: 40.22222222222222

In [2]:
df = pd.read_csv('titanic.csv')

In [4]:
df.head()

,Survived,Pclass,Sex,Age,Siblings/Spouses,Parents/Children,Fare
0,0,3,male,22.0,1,0,7.2500
1,1,1,female,38.0,1,0,71.2833
2,1,3,female,26.0,0,0,7.9250
3,1,1,female,35.0,1,0,53.1000

In [5]:
df.tail()

,Survived,Pclass,Sex,Age,Siblings/Spouses,Parents/Children,Fare
0,0,3,male,22.0,1,0,7.2500
1,1,1,female,38.0,1,0,71.2833
2,1,3,female,26.0,0,0,7.9250
3,1,1,female,35.0,1,0,53.1000

In [6]:
df.describe()

,Survived,Pclass,Age,Siblings/Spouses,Parents/Children,Fare
count,4.00,4.000000,4.00,4.00,4.0,4.000000
mean,0.75,2.000000,30.25,0.75,0.0,34.889575
std,0.50,1.154701,7.50,0.50,0.0,32.389078
min,0.00,1.000000,22.00,0.00,0.0,7.250000
25%,0.75,1.000000,25.00,0.75,0.0,7.756250
50%,1.00,2.000000,30.50,1.00,0.0,30.512500
75%,1.00,3.000000,35.75,1.00,0.0,57.645825
max,1.00,3.000000,38.00,1.00,0.0,71.283300

In [11]:
df.columns

Index(['Survived', ' Pclass', ' Sex', ' Age', ' Siblings/Spouses',
       ' Parents/Children', ' Fare'],
      dtype='object')

In [12]:
col = df[' Fare']
print(col)

0     7.2500
1    71.2833
2     7.9250
3    53.1000
Name:  Fare, dtype: float64